# TemporaryGraphicsCommandData Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TemporaryGraphicsCommandData Members
TemporaryGraphicsCommandData Class Methods Properties See Also
---
The TemporaryGraphicsCommandData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the TemporaryGraphicsCommandData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | The document. |
| Index | The unique index of the temporary graphics object managed by TemporaryGraphicsManager. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace